ИС_СПОРТ_2022/src/Catalogs/Спортсмены/Спортсмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спортсмены</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСпортсмена</name>
    <type>
      <types>EnumRef.СтатусыСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонДиспансеризации</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>СовпадаетАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОсобенностиЗдоровья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяИнвалидностьПоОбщемуЗаболеванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеютсяИнтеллектуальныеНарушения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеЗрения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеСлуха</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеОДА</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПФЗ</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиФизическогоЗдоровья</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/InformationRegisters/СоставГруппы/СоставГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставГруппы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТренерСборной</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </resources>
  <resources>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группа</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИсключенияИзГруппы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.ОснованияДляОтчисленияСпортсменов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаУдалить</name>
    <type>
      <types>CatalogRef.Группа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Catalogs/Спортсмены/Forms/ФормаВыбораСпортсменаПоУчреждению/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТолькоВыбор") Тогда
		Элементы.СписокПодобрать.Видимость         = Ложь;
		Элементы.ФормаВыбрать.КнопкаПоУмолчанию    = Истина;
		ВыборЗначения = Истина;
	ИначеЕсли Параметры.Свойство("ТолькоПодбор") Тогда
		Элементы.ФормаВыбрать.Видимость            = Ложь;
		Элементы.СписокПодобрать.КнопкаПоУмолчанию = Истина;
		
		// {Рарус adilas #-7400 -Команда подбор спортменов, открыть форму выбора справочника  2020.07.26
		Если Параметры.Свойство("ИдентификаторИсключениеИзГруппы") Тогда
			Список.ТекстЗапроса = ТекстЗапросаПереопределяемый();
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТренерСборной", Параметры.Тренер);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Группа"       , Параметры.Группа);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "МоментВремени", Параметры.МоментВремени);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось открыть форму " + ОписаниеОшибки());
		// }Рарус adilas #-7400 -Команда подбор спортменов, открыть форму выбора справочника  2020.07.26
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаСреза"  , Параметры.ДатаСреза); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидСпорта"  , Параметры.ВидСпорта); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Организация", Параметры.Организация);
	
	// {Рарус dotere #-16299 -Проверка на свойство  2021.05.28
	Если Параметры.Свойство("УчебныйГод") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "УчебныйГод", Параметры.УчебныйГод);
	КонецЕсли
	// }Рарус dotere #-16299 -Проверка на свойство  2021.05.28
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ВыборЗначения Тогда
		Оповестить("ПодборСпискаСпортсменов",Новый Структура("СписокСпортсменов",СписокСпортсменов)); 	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДинамическогоСписка

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ВыборЗначения Тогда
	   ВыбратьЗначениеИЗакрыть();
    Иначе
	   ПодобратьЗначение();
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПодобратьЗначение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьЗначениеИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьЗначениеИЗакрыть()
	
	ТекСпортсмен = Неопределено;
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ТекСпортсмен = ТекДанные.Ссылка;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Новый Структура("Спортсмен",ТекСпортсмен));
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодобратьЗначение()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		СписокСпортсменов.Добавить(ТекДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

// {Рарус adilas #-7400 -Команда подбор спортменов, открыть форму выбора справочника  2020.07.26
&НаСервере
Функция ТекстЗапросаПереопределяемый()

	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	СоставГруппыСрезПоследних.Спортсмен КАК Спортсмен
	        |ПОМЕСТИТЬ ВТ_СоставГруппы
	        |ИЗ
	        |	РегистрСведений.СоставГруппы.СрезПоследних КАК СоставГруппыСрезПоследних
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Спортсмен
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Спортсмены.Ссылка КАК Ссылка,
	        |	ФизическиеЛица.ДатаРождения КАК ДатаРождения
	        |ИЗ
	        |	ВТ_СоставГруппы КАК ВТ_СоставГруппы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спортсмены КАК Спортсмены
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	        |			ПО Спортсмены.ФизическоеЛицо = ФизическиеЛица.Ссылка
	        |		ПО ВТ_СоставГруппы.Спортсмен = Спортсмены.Ссылка";

КонецФункции
// }Рарус adilas #-7400 -Команда подбор спортменов, открыть форму выбора справочника  2020.07.26

#КонецОбласти
